
require '英雄.黑暗游侠.测试'
return ac.hero.create '黑暗游侠'
{
	--物编中的id
	id = 'N001',

	model_source = '魔兽自带',

	hero_designer = 'Mtp719',

	hero_scripter = 'Mtp719',

	--技能数量
	skill_count = 1,

	skill_names = '测试',

	attribute = {
		['生命上限'] = 920,
		['魔法上限'] = 650,
		['生命恢复'] = 3.2,
		['魔法恢复'] = 1,
		['魔法脱战恢复'] = 0,
		['攻击']    = 35,
		['护甲']    = 12,
		['移动速度'] = 300,
		['攻击间隔'] = 1.2,
		['攻击距离'] = 600,
	},

	upgrade = {
		['生命上限'] = 115,
		['魔法上限'] = 42,
		['生命恢复'] = 0.21,
		['魔法恢复'] = 0.1,
		['攻击']    = 3.3,
		['护甲']    = 1.2,
	},

	weapon = {
		['弹道模型'] = [[Abilities\Weapons\Arrow\ArrowMissile.mdl]],
		['弹道速度'] = 2000,
		['弹道弧度'] = 0.15,
		['弹道出手'] = {15, 0, 66},
	},
}